{
    "class_name": "Model", 
    "keras_version": "2.0.8", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "inbound_nodes": [], 
                "config": {
                    "dtype": "float32", 
                    "batch_input_shape": [
                        null, 
                        28, 
                        28, 
                        1
                    ], 
                    "name": "input_1", 
                    "sparse": false
                }, 
                "name": "input_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "input_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "normal", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_in"
                        }
                    }, 
                    "name": "conv2d_1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 32, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_1"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_1"
                }, 
                "name": "activation_1"
            }, 
            {
                "class_name": "Conv2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "normal", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_in"
                        }
                    }, 
                    "name": "conv2d_2", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "padding": "valid", 
                    "strides": [
                        1, 
                        1
                    ], 
                    "dilation_rate": [
                        1, 
                        1
                    ], 
                    "kernel_regularizer": null, 
                    "filters": 64, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "use_bias": true, 
                    "activity_regularizer": null, 
                    "kernel_size": [
                        3, 
                        3
                    ]
                }, 
                "name": "conv2d_2"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_2"
                }, 
                "name": "activation_2"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "inbound_nodes": [
                    [
                        [
                            "activation_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "name": "max_pooling2d_1", 
                    "trainable": true, 
                    "data_format": "channels_last", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "padding": "same", 
                    "strides": [
                        2, 
                        2
                    ]
                }, 
                "name": "max_pooling2d_1"
            }, 
            {
                "class_name": "Dropout", 
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_1"
                }, 
                "name": "dropout_1"
            }, 
            {
                "class_name": "Flatten", 
                "inbound_nodes": [
                    [
                        [
                            "dropout_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "trainable": true, 
                    "name": "flatten_1"
                }, 
                "name": "flatten_1"
            }, 
            {
                "class_name": "Dense", 
                "inbound_nodes": [
                    [
                        [
                            "flatten_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "normal", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_in"
                        }
                    }, 
                    "name": "dense_1", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 128, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "name": "dense_1"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "dense_1", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_3"
                }, 
                "name": "activation_3"
            }, 
            {
                "class_name": "Dropout", 
                "inbound_nodes": [
                    [
                        [
                            "activation_3", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "rate": 0.5, 
                    "trainable": true, 
                    "name": "dropout_2"
                }, 
                "name": "dropout_2"
            }, 
            {
                "class_name": "Dense", 
                "inbound_nodes": [
                    [
                        [
                            "dropout_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling", 
                        "config": {
                            "distribution": "normal", 
                            "scale": 1.0, 
                            "seed": null, 
                            "mode": "fan_in"
                        }
                    }, 
                    "name": "dense_2", 
                    "kernel_constraint": null, 
                    "bias_regularizer": null, 
                    "bias_constraint": null, 
                    "activation": "linear", 
                    "trainable": true, 
                    "kernel_regularizer": null, 
                    "bias_initializer": {
                        "class_name": "Zeros", 
                        "config": {}
                    }, 
                    "units": 10, 
                    "use_bias": true, 
                    "activity_regularizer": null
                }, 
                "name": "dense_2"
            }, 
            {
                "class_name": "Activation", 
                "inbound_nodes": [
                    [
                        [
                            "dense_2", 
                            0, 
                            0, 
                            {}
                        ]
                    ]
                ], 
                "config": {
                    "activation": "softmax", 
                    "trainable": true, 
                    "name": "activation_4"
                }, 
                "name": "activation_4"
            }
        ], 
        "input_layers": [
            [
                "input_1", 
                0, 
                0
            ]
        ], 
        "name": "CNN", 
        "output_layers": [
            [
                "activation_4", 
                0, 
                0
            ]
        ]
    }, 
    "backend": "tensorflow"
}